app/controllers/checkins_controller.rb

INSERT INTO "checkins" ("driver_id", "hours", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["driver_id", 8], ["hours", 5], ["created_at", "2020-12-09 08:19:34.310788"], ["updated_at", "2020-12-09 08:19:34.310788"]]
---
  def create
    @checkin = Checkin.new(checkin_params)
    if @checkin.save