app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def create
    @driver = Driver.new(driver_params)

    if @driver.save
---
INSERT INTO "drivers" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Tran Thi My Linh"], ["email", "mylinh3591@gmail.com"], ["created_at", "2020-12-08 15:20:25.653740"], ["updated_at", "2020-12-08 15:20:25.653740"]]

  def update
    @drivers = Driver.all
    if @driver
      respond_to do |format|
        if @driver.update(driver_params)
---
SELECT "drivers".* FROM "drivers"
UPDATE "drivers" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "drivers"."id" = $4  [["name", "eduard"], ["email", "feliu09@gmail.com"], ["updated_at", "2020-12-08 18:23:50.633199"], ["id", 1]]

  def destroy
    respond_to do |format|
      if @driver.destroy
---
DELETE FROM "drivers" WHERE "drivers"."id" = $1  [["id", 2]]

  def find_driver
    @driver = Driver.find(params[:id])
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]